Artillery/API-perf-tests/airbnb-api-perf-test.yml
config:
  target: https://www.airbnb.com/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase

scenarios:
  - flow:
      - loop:
          - get:
              url: "/host/homes"
          - get:
              url: "/giftcards"
          - get:
              url: "/help"
        count: 100